DataProcessors/ЗагрузкаКурсовВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаКурсовВалют</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеКурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>35</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БазоваяВалюта</Name>
					<Comment>Валюта, по отношению к которой хранится курс</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/Кошельки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<AccumulationRegister>
		<Properties>
			<Name>Кошельки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/КлючНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>КлючНастроек</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КлючОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗагрузкаКурсовВалют/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПараметрыЗагрузкиКурсовВалют() Экспорт 
	
	Результат = Новый Структура("НачалоПериодаЗагрузки, ОкончаниеПериодаЗагрузки, Валюты");
	
	ТекущаяДата = ТекущаяДата();
	
	ПоследниеКурсы = РегистрыСведений.КурсыВалют.СрезПоследних();
	
	ПоискРубля = ПоследниеКурсы.НайтиСтроки(Новый Структура("Валюта", ЗначениеНастроекВызовСервераПовтИсп.ПолучитьЗначениеКонстанты("ВалютаУчета")));
	
	Если ПоискРубля.Количество() > 0 Тогда 
		ПоследниеКурсы.Удалить(ПоследниеКурсы.Индекс(ПоискРубля[0]));		
	КонецЕсли;
	
	ПоследниеКурсы.Сортировать("Период");
	
	Если ПоследниеКурсы.Количество() > 0 Тогда 
		Результат.НачалоПериодаЗагрузки = НачалоДня(ПоследниеКурсы[0].Период);
	Иначе
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	МИНИМУМ(Кошельки.Период) КАК Период
		|ИЗ
		|	РегистрНакопления.Кошельки КАК Кошельки");
		Рез = Запрос.Выполнить().Выбрать();
		
		Если Рез.Следующий() Тогда 
			Если Рез.Период <> NULL Тогда 
				Результат.НачалоПериодаЗагрузки = Рез.Период;
			Иначе
				Результат.НачалоПериодаЗагрузки = Мин(НачалоГода(ТекущаяДата), НачалоДня(ТекущаяДата) - 7 * 24 * 60 * 60);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат.ОкончаниеПериодаЗагрузки = НачалоДня(ТекущаяДата);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Валюты.Ссылка КАК Валюта,
	|	Валюты.Код КАК КодВалюты
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	Валюты.Ссылка В(&Валюты)");
	Запрос.УстановитьПараметр("Валюты", ОбщиеНастройкиВызовСервера.ОбщиеНастройкиЗагрузить(Метаданные.Обработки.ЗагрузкаКурсовВалют.Имя,
	ЗагрузитьОсновнуюНастройку(), Новый Массив));
	
	Результат.Валюты = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Функция ЗагрузитьОсновнуюНастройку() Экспорт 
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	КлючНастроек.Ссылка
	|ИЗ
	|	Справочник.КлючНастроек КАК КлючНастроек
	|ГДЕ
	|	КлючНастроек.Основная
	|	И КлючНастроек.КлючОбъекта = &КлючОбъекта");
	Запрос.УстановитьПараметр("КлючОбъекта", Метаданные.Обработки.ЗагрузкаКурсовВалют.Имя); 
	
	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда		
		Возврат Рез.ссылка;
	КонецЕсли;
	
	Возврат Справочники.КлючНастроек.ПустаяСсылка();
	
КонецФункции

#КонецОбласти

#КонецЕсли
